
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 8 to change, 11 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * azurerm_resource_group.rg
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic
  * module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.Insights/components/hmc-aat"
        name                                  = "hmc-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
            "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/cc5e7f4de4bd43678ca62364abc1127a"
        name                    = "hmc-servicebus-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/aadc74b87d5f431baf328cdb247b3a45"
        name                    = "hmc-servicebus-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat"
        name     = "hmc-shared-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (1 unchanged attribute hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ capacity                            = 1 -> 0
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://hmc-servicebus-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ minimum_tls_version                 = "1.0" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Premium" -> "Standard" # forces replacement
      ~ tags                                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
      ~ zone_redundant                      = true -> false # forces replacement
        # (4 unchanged attributes hidden)

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-aat"
      + resource_group_name                 = "hmc-shared-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-aat"
      + resource_group_name                 = "hmc-shared-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-from-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "hmc-to-cft-aat"
      + namespace_name                          = "hmc-servicebus-aat"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "hmc-shared-aat"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-subs-to-cft-aat" -> (known after apply)
        name                                      = "hmc-subs-to-cft-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "hmc-shared-aat"
      + tags       = (known after apply)
    }

  # module.servicebus-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "hmc-servicebus-aat"
      + resource_group_name                 = "hmc-shared-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "hmc-to-cft-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat"
        name                            = "hmc-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git" -> null
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat/objectId/7df9d173-631b-47a6-8737-0f15616d25f0"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat|hmc-aat"
        name                       = "hmc-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 11 to add, 8 to change, 11 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Vars":{}} -->